#include "output_func.h"
#include "tree.h"

void print_err_msg(error rc)
{
    if (rc == OK)
        return;

    switch (rc)
    {
        case OK:
            break;
        case INVALID_INPUT:
            printf("Некоректный ввод");
            break;
        case CMD_OUT_OF_RANGE:
            printf("Номер команды превышает максимальный");
            break;
        case READ_ERROR:
            printf("Ошибка чтения");
            break;
        case STR_OVERFLOW:
            printf("Строка длинее %d", STR_LEN);
            break;
        case STR_EMPTY:
            printf("Пустая строка");
            break;
        case MEMORY_ERROR:
            printf("Ошибка выделения памяти ");
            break;
        case VALUE_ALREADY_IN_TREE:
            printf("Значение уже находиться в дереве");
            break;
        case VALUE_NOT_IN_TREE:
            printf("Значения нет в дереве");
            break;
        case OPEN_FILE_ERROR:
            printf("Ошибка открытия файла");
            break;
        case EMPTY_FILE:
            printf("Пустой файл");
            break;
        default:
            printf("Неизвестваня ошибка");
            break;
    }
    if (rc)
        printf("\n");
}



void print_prog_mode_list(void)
{
    printf(
        "|---------------------------|----------------------------|\n"
        "|   Режим работы программы  |----------------------------|\n"
        "|---------------------------|----------------------------|\n"
        "| 1. Эмуляция дерева                                     |\n"
        "| 2. Выполнить сравнение                                 |\n"
        "| 0. Выход                                               |\n"
        "|--------------------------------------------------------|\n"
    );
}

void print_action_cmd_list(void)
{
    printf(
        "\n\n"
        "|---------------------------|----------------------------|\n"
        "| Взаимодействие с деревом  |----------------------------|\n"
        "|---------------------------|----------------------------|\n"
        "| 1. Добавить элемент                                    |\n"
        "| 2. Удалить элемент                                     |\n"
        "|                                                        |\n"
        "| 3. Определить количество вершин,                       |\n"
        "|    начинающихся на введенную букву                     |\n"
        "| 4. Сравнить поиск слов, начинающихся                   |\n"
        "|    на введенную букву, в дереве и файле                |\n"
        "|---------------------------|----------------------------|\n"
        "|     Ввод/Вывод дерева     |----------------------------|\n"
        "|---------------------------|----------------------------|\n"
        "| 5. Считать дерево из файла (текущее будет удалено)     |\n"
        "|                                                        |\n"
        "| 6. Быстрый экспорт (в файл tree.png)                   |\n"
        "| 7. Быстрый экспорт с подстветской (в файл tree.png)    |\n"
        "| 8. Экспорт                                             |\n"
        "| 9. Экспорт с подстветской                              |\n"
        "|                                                        |\n"
        "|---------------------------|----------------------------|\n"
        "|         Остальное         |----------------------------|\n"
        "|---------------------------|----------------------------|\n"
        "| 0. Выход                                               |\n"
        "|--------------------------------------------------------|\n"
    );
}
